wrapper_tests/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  | =========                 |                                                 |
  | \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
  |  \\    /   O peration     | Version:  v3.0+                                 |
  |   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
  |    \\/     M anipulation  |                                                 |
  \*---------------------------------------------------------------------------*/
FoamFile
{
  version     2.0;
  format      ascii;
  class       volVectorField;
  object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
  topWall
  {
    type            zeroGradient;
  }

  fixedWalls
  {
    type            fixedValue;
    value           uniform (0 0 0);
  }

  frontAndBack
  {
    type            fixedValue;
    value           uniform (0 0 0);
  }
}

// ************************************************************************* //
